rtkconnectivity/hal_realtek/bee/drivers/enh_tim/src/rtl8772f/rtl_enhtim_def.h
/**
**********************************************************************************************************
*               Copyright(c) 2023, Realtek Semiconductor Corporation. All rights reserved.
**********************************************************************************************************
* @file     rtl_enhtimer_def.h
* @brief    ENH_TIM related definitions for RTL87x2F
* @details
* @author   Grace_yan
* @date     2023.02.14
* @version  v1.0.1
*********************************************************************************************************
*/
#ifndef RTL_ENHTIM_DEF_H
#define RTL_ENHTIM_DEF_H

#include <stdint.h>
#include <stdbool.h>
#include "rtl876x.h"

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */


/* ================================================================================ */
/* ================                  ENHTIM  Defines               ================ */
/* ================================================================================ */
/** \defgroup ENHTIM_Exported_Constants ENHTIM Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup ENHTIM_Defines ENHTIM Defines
 * \{
 * \ingroup  ENHTIM_Exported_Constants
 */
#define CHIP_ENHTIM_CHANNEL_NUM                        (8)
#define ENHTIM_SUPPORT_LATCH_CNT_0                     (1)
#define ENHTIM_SUPPORT_LATCH_CNT_1                     (0)
#define ENHTIM_SUPPORT_LATCH_CNT_2                     (0)
#define ENHTIM_SUPPORT_PWM_PHASE_SHIFT                 (0)
#define ENHTIM_SUPPORT_PWM_SRC_SELECT                  (0)
#define ENHTIM_SUPPORT_ONESHOT_CMD                     (0)

/** End of ENHTIM_Defines
  * \}
  */

/** End of ENHTIM_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         ENHTIM Registers Memory Map
 *============================================================================*/
typedef struct
{
    __I  uint32_t ENHTIM_CUR_CNT;                /*!< 0x00 */
    __I  uint32_t ENHTIM_LATCH_CNT_0;            /*!< 0x04 */
    __I  uint32_t ENHTIM_LATCH_CNT_1;            /*!< 0x08 */
    __I  uint32_t ENHTIM_LATCH_CNT_2;            /*!< 0x0C */
    __IO uint32_t ENHTIM_CONFIGURE;              /*!< 0x10 */
    __IO uint32_t ENHTIM_MAX_CNT;                /*!< 0x14 */
    __IO uint32_t ENHTIM_CCR;                    /*!< 0x18 */
    __IO uint32_t ENHTIM_CCR_FIFO_ENTRY;         /*!< 0x1C */
} ENHTIM_TypeDef;

typedef struct
{
    __IO uint32_t ENHTIM_LACTH_FIFO_TH_STATUS;   /*!< 0x120 */
    __IO uint32_t ENHTIM_LATCH_CNT_FIFO_STATUS;  /*!< 0x124 */
    __I  uint32_t ENHTIM_CCR_FIFO_STATUS;        /*!< 0x128 */
    __IO uint32_t ENHTIM_FIFO_CLR;               /*!< 0x12C */
    __IO uint32_t ENHTIM_CONTROL;                /*!< 0x130 */
    __IO uint32_t ENHTIM_INT_CONTROL;            /*!< 0x134 */
    __IO uint32_t ENHTIM_STATUS;                 /*!< 0x138 */
    __I  uint32_t ENHTIM_INT_STATUS;             /*!< 0x13C */
    __IO uint32_t ENHTIM_LATCH_INT_CONTROL_0;    /*!< 0x140 */
    __IO uint32_t RESERVED0;                     /*!< 0x144 */
    __IO uint32_t ENHTIM_LATCH_INT_CONTROL_2;    /*!< 0x148 */
    __IO uint32_t RESERVED1;                     /*!< 0x14C */
    __I  uint32_t ENHTIM0_LATCH_FIFO_DEPTH;      /*!< 0x150 */
    __I  uint32_t ENHTIM1_LATCH_FIFO_DEPTH;      /*!< 0x154 */
    __I  uint32_t ENHTIM2_LATCH_FIFO_DEPTH;      /*!< 0x158 */
    __I  uint32_t ENHTIM3_LATCH_FIFO_DEPTH;      /*!< 0x15C */
    __I  uint32_t ENHTIM4_LATCH_FIFO_DEPTH;      /*!< 0x160 */
    __I  uint32_t ENHTIM5_LATCH_FIFO_DEPTH;      /*!< 0x164 */
    __I  uint32_t ENHTIM6_LATCH_FIFO_DEPTH;      /*!< 0x168 */
    __I  uint32_t ENHTIM7_LATCH_FIFO_DEPTH;      /*!< 0x16C */
    __I  uint32_t ENHTIM_TOGGLE_STATE;           /*!< 0x170 */
} ENHTIM_ShareTypeDef;

typedef struct
{
    __IO uint32_t ENHTIMER_PWM_WRAP_CFG;         /*!< 0x270 */
} ENHPWM_TypeDef;

typedef struct
{
    __I  uint32_t ENHTIM_IP_VER;                 /*!< 0x360 */
} ENHTIM_IP_VER_TypeDef;

/*============================================================================*
 *                         ENHTIM Declaration
 *============================================================================*/
#define ENH_TIM0           ((ENHTIM_TypeDef        *) ENHANCED_TIMER0_REG_BASE)
#define ENH_TIM1           ((ENHTIM_TypeDef        *) ENHANCED_TIMER1_REG_BASE)
#define ENH_TIM2           ((ENHTIM_TypeDef        *) ENHANCED_TIMER2_REG_BASE)
#define ENH_TIM3           ((ENHTIM_TypeDef        *) ENHANCED_TIMER3_REG_BASE)
#define ENH_TIM4           ((ENHTIM_TypeDef        *) ENHANCED_TIMER4_REG_BASE)
#define ENH_TIM5           ((ENHTIM_TypeDef        *) ENHANCED_TIMER5_REG_BASE)
#define ENH_TIM6           ((ENHTIM_TypeDef        *) ENHANCED_TIMER6_REG_BASE)
#define ENH_TIM7           ((ENHTIM_TypeDef        *) ENHANCED_TIMER7_REG_BASE)
#define ENH_TIM_SHARE      ((ENHTIM_ShareTypeDef   *) ENHTIM_SHARE_REG_BASE)
#define ENH_TIM0_PWM       ((ENHPWM_TypeDef        *) ENHTIM0_PWM_REG_BASE)
#define ENH_TIM1_PWM       ((ENHPWM_TypeDef        *) ENHTIM1_PWM_REG_BASE)
#define ENH_TIM2_PWM       ((ENHPWM_TypeDef        *) ENHTIM2_PWM_REG_BASE)
#define ENH_TIM3_PWM       ((ENHPWM_TypeDef        *) ENHTIM3_PWM_REG_BASE)
#define ENH_TIM4_PWM       ((ENHPWM_TypeDef        *) ENHTIM4_PWM_REG_BASE)
#define ENH_TIM5_PWM       ((ENHPWM_TypeDef        *) ENHTIM5_PWM_REG_BASE)
#define ENH_TIM6_PWM       ((ENHPWM_TypeDef        *) ENHTIM6_PWM_REG_BASE)
#define ENH_TIM7_PWM       ((ENHPWM_TypeDef        *) ENHTIM7_PWM_REG_BASE)
#define ENH_TIM8_PWM       ((ENHPWM_TypeDef        *) ENHTIM8_PWM_REG_BASE)
#define ENHTIM_IP_VER      ((ENHTIM_IP_VER_TypeDef *) (ENHANCED_TIMER_REG_BASE+0X360))

/*============================================================================*
 *                         ENHTIM Private Defines
 *============================================================================*/
#define ENHTIM_CLK_CTRL      *((volatile uint32_t *)0x400E2174UL)

/*============================================================================*
 *                         ENHTIM Registers and Field Descriptions
 *============================================================================*/
/* 0x00
   31:0    R      Enhtimer_cur_cnt                            32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer_cur_cnt: 32;
    } b;
} ENHTIM_CUR_CNT_t;



