rtkconnectivity/hal_realtek/bee/drivers/enh_tim/src/rtl8772f/rtl_enhtim_def.h
/* 0x04
   31:0    R      Enhtimer_latch_cnt_0                        32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer_latch_cnt_0: 32;
    } b;
} ENHTIM_LATCH_CNT_0_t;



/* 0x08
   31:0    R      RSVD                        32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t reserved: 32;
    } b;
} ENHTIM_LATCH_CNT_1_t;



/* 0x0C
   31:0    R      RSVD                        32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t reserved: 32;
    } b;
} ENHTIM_LATCH_CNT_2_t;



/* 0x10
   1:0     R/W    Enhtimer_mode                               2'h0
   2       R/W    Enhtimer_PWM_polarity                       1'h0
   3       R/W    Enhtimer_PWM_output_en                      1'h0
   5:4     R/W    Enhtimer_latch_cnt_0_trig_mode              2'h0
   7:6     R/W    RSVD                                        2'h0
   9:8     R/W    RSVD                                        2'h0
   10      R/W    Enhtimer_Latch_cnt_0_en                     1'h0
   11      R/W    RSVD                                        1'h0
   12      R/W    RSVD                                        1'h0
   17:13   R/W    Enhtimer_latch_cnt_0_fifo_th                5'h1
   22:18   R/W    RSVD                                        5'h1
   27:23   R/W    RSVD                                        5'h1
   28      R/W    Enhtimer_dma_en                             1'h0
   29      R/W    Enhtimer_dma_mode                           1'h0
   31:30   R/W    Enhtimer_dma_target                         2'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer_mode: 2;
        __IO uint32_t Enhtimer_PWM_polarity: 1;
        __IO uint32_t Enhtimer_PWM_output_en: 1;
        __IO uint32_t Enhtimer_latch_cnt_0_trig_mode: 2;
        __IO uint32_t reserved_5: 2;
        __IO uint32_t reserved_4: 2;
        __IO uint32_t Enhtimer_Latch_cnt_0_en: 1;
        __IO uint32_t reserved_3: 1;
        __IO uint32_t reserved_2: 1;
        __IO uint32_t Enhtimer_latch_cnt_0_fifo_th: 5;
        __IO uint32_t reserved_1: 5;
        __IO uint32_t reserved_0: 5;
        __IO uint32_t Enhtimer_dma_en: 1;
        __IO uint32_t Enhtimer_dma_mode: 1;
        __IO uint32_t Enhtimer_dma_target: 2;
    } b;
} ENHTIM_CONFIGURE_t;



/* 0x14
   31:0    R/W    Enhtimer_max_cnt                            32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer_max_cnt: 32;
    } b;
} ENHTIM_MAX_CNT_t;



/* 0x18
   31:0    R/W    Enhtimer_ccr                                32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer_ccr: 32;
    } b;
} ENHTIM_CCR_t;



/* 0x1C
   31:0    R/W    Enhtimer_ccr_fifo_entry                     32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer_ccr_fifo_entry: 32;
    } b;
} ENHTIM_CCR_FIFO_ENTRY_t;




/* 0x120
   0       R/W1C  Enhtimer0_latch_cnt_0_fifo_met_th           1'h0
   1       R/W1C  Enhtimer1_latch_cnt_0_fifo_met_th           1'h0
   2       R/W1C  Enhtimer2_latch_cnt_0_fifo_met_th           1'h0
   3       R/W1C  Enhtimer3_latch_cnt_0_fifo_met_th           1'h0
   4       R/W1C  Enhtimer4_latch_cnt_0_fifo_met_th           1'h0
   5       R/W1C  Enhtimer5_latch_cnt_0_fifo_met_th           1'h0
   6       R/W1C  Enhtimer6_latch_cnt_0_fifo_met_th           1'h0
   7       R/W1C  Enhtimer7_latch_cnt_0_fifo_met_th           1'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer0_latch_cnt_0_fifo_met_th: 1;
        __IO uint32_t Enhtimer1_latch_cnt_0_fifo_met_th: 1;
        __IO uint32_t Enhtimer2_latch_cnt_0_fifo_met_th: 1;
        __IO uint32_t Enhtimer3_latch_cnt_0_fifo_met_th: 1;
        __IO uint32_t Enhtimer4_latch_cnt_0_fifo_met_th: 1;
        __IO uint32_t Enhtimer5_latch_cnt_0_fifo_met_th: 1;
        __IO uint32_t Enhtimer6_latch_cnt_0_fifo_met_th: 1;
        __IO uint32_t Enhtimer7_latch_cnt_0_fifo_met_th: 1;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM_LACTH_FIFO_TH_STATUS_t;



/* 0x124
   0       R/W1C  Enhtimerr0_latch_cnt_0_fifo_full            1'h0
   1       R      Enhtimer0_latch_cnt_0_fifo_empty            1'h1
   2       R/W1C  Enhtimer1_latch_cnt_0_fifo_full             1'h0
   3       R      Enhtimer1_latch_cnt_0_fifo_empty            1'h1
   4       R/W1C  Enhtimer2_latch_cnt_0_fifo_full             1'h0
   5       R      Enhtimer2_latch_cnt_0_fifo_empty            1'h1
   6       R/W1C  Enhtimer3_latch_cnt_0_fifo_full             1'h0
   7       R      Enhtimer3_latch_cnt_0_fifo_empty            1'h1
   8       R/W1C  Enhtimer4_latch_cnt_0_fifo_full             1'h0
   9       R      Enhtimer4_latch_cnt_0_fifo_empty            1'h1
   10      R/W1C  Enhtimer5_latch_cnt_0_fifo_full             1'h0
   11      R      Enhtimer5_latch_cnt_0_fifo_empty            1'h1
   12      R/W1C  Enhtimer6_latch_cnt_0_fifo_full             1'h0
   13      R      Enhtimer6_latch_cnt_0_fifo_empty            1'h1
   14      R/W1C  Enhtimer7_latch_cnt_0_fifo_full             1'h0
   15      R      Enhtimer7_latch_cnt_0_fifo_empty            1'h1
   31:16   R      RSVD                                        16'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimerr0_latch_cnt_0_fifo_full: 1;
        __I uint32_t Enhtimer0_latch_cnt_0_fifo_empty: 1;
        __IO uint32_t Enhtimer1_latch_cnt_0_fifo_full: 1;
        __I uint32_t Enhtimer1_latch_cnt_0_fifo_empty: 1;
        __IO uint32_t Enhtimer2_latch_cnt_0_fifo_full: 1;
        __I uint32_t Enhtimer2_latch_cnt_0_fifo_empty: 1;
        __IO uint32_t Enhtimer3_latch_cnt_0_fifo_full: 1;
        __I uint32_t Enhtimer3_latch_cnt_0_fifo_empty: 1;
        __IO uint32_t Enhtimer4_latch_cnt_0_fifo_full: 1;
        __I uint32_t Enhtimer4_latch_cnt_0_fifo_empty: 1;
        __IO uint32_t Enhtimer5_latch_cnt_0_fifo_full: 1;
        __I uint32_t Enhtimer5_latch_cnt_0_fifo_empty: 1;
        __IO uint32_t Enhtimer6_latch_cnt_0_fifo_full: 1;
        __I uint32_t Enhtimer6_latch_cnt_0_fifo_empty: 1;
        __IO uint32_t Enhtimer7_latch_cnt_0_fifo_full: 1;
        __I uint32_t Enhtimer7_latch_cnt_0_fifo_empty: 1;
        __I uint32_t reserved_0: 16;
    } b;
} ENHTIM_LATCH_CNT_FIFO_STATUS_t;



/* 0x128
   0       R      Enhtimerr0_ccr_fifo_full                    1'h0
   1       R      Enhtimer0_ccr_fifo_empty                    1'h1
   2       R      Enhtimer1_ccr_fifo_full                     1'h0
   3       R      Enhtimer1_ccr_fifo_empty                    1'h1
   4       R      Enhtimer2_ccr_fifo_full                     1'h0
   5       R      Enhtimer2_ccr_fifo_empty                    1'h1
   6       R      Enhtimer3_ccr_fifo_full                     1'h0
   7       R      Enhtimer3_ccr_fifo_empty                    1'h1
   8       R      Enhtimer4_ccr_fifo_full                     1'h0
   9       R      Enhtimer4_ccr_fifo_empty                    1'h1
   10      R      Enhtimer5_ccr_fifo_full                     1'h0
   11      R      Enhtimer5_ccr_fifo_empty                    1'h1
   12      R      Enhtimer6_ccr_fifo_full                     1'h0
   13      R      Enhtimer6_ccr_fifo_empty                    1'h1
   14      R      Enhtimer7_ccr_fifo_full                     1'h0
   15      R      Enhtimer7_ccr_fifo_empty                    1'h1
   31:16   R      RSVD                                        16'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimerr0_ccr_fifo_full: 1;
        __I uint32_t Enhtimer0_ccr_fifo_empty: 1;
        __I uint32_t Enhtimer1_ccr_fifo_full: 1;
        __I uint32_t Enhtimer1_ccr_fifo_empty: 1;
        __I uint32_t Enhtimer2_ccr_fifo_full: 1;
        __I uint32_t Enhtimer2_ccr_fifo_empty: 1;
        __I uint32_t Enhtimer3_ccr_fifo_full: 1;
        __I uint32_t Enhtimer3_ccr_fifo_empty: 1;
        __I uint32_t Enhtimer4_ccr_fifo_full: 1;
        __I uint32_t Enhtimer4_ccr_fifo_empty: 1;
        __I uint32_t Enhtimer5_ccr_fifo_full: 1;
        __I uint32_t Enhtimer5_ccr_fifo_empty: 1;
        __I uint32_t Enhtimer6_ccr_fifo_full: 1;
        __I uint32_t Enhtimer6_ccr_fifo_empty: 1;
        __I uint32_t Enhtimer7_ccr_fifo_full: 1;
        __I uint32_t Enhtimer7_ccr_fifo_empty: 1;
        __I uint32_t reserved_0: 16;
    } b;
} ENHTIM_CCR_FIFO_STATUS_t;



/* 0x12C
   0       R/W1C  Enhtimer0_ccr_fifo_clr                      1'h0
   1       R/W1C  Enhtimer1_ccr_fifo_clr                      1'h0
   2       R/W1C  Enhtimer2_ccr_fifo_clr                      1'h0
   3       R/W1C  Enhtimer3_ccr_fifo_clr                      1'h0
   4       R/W1C  Enhtimer4_ccr_fifo_clr                      1'h0
   5       R/W1C  Enhtimer5_ccr_fifo_clr                      1'h0
   6       R/W1C  Enhtimer6_ccr_fifo_clr                      1'h0
   7       R/W1C  Enhtimer7_ccr_fifo_clr                      1'h0
   8       R/W1C  Enhtimer0_latch_cnt_0_fifo_clr              1'h0
   9       R/W1C  Enhtimer1_latch_cnt_0_fifo_clr              1'h0
   10      R/W1C  Enhtimer2_latch_cnt_0_fifo_clr              1'h0
   11      R/W1C  Enhtimer3_latch_cnt_0_fifo_clr              1'h0
   12      R/W1C  Enhtimer4_latch_cnt_0_fifo_clr              1'h0
   13      R/W1C  Enhtimer5_latch_cnt_0_fifo_clr              1'h0
   14      R/W1C  Enhtimer6_latch_cnt_0_fifo_clr              1'h0
   15      R/W1C  Enhtimer7_latch_cnt_0_fifo_clr              1'h0
   31:16   R      RSVD                                        16'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer0_ccr_fifo_clr: 1;
        __IO uint32_t Enhtimer1_ccr_fifo_clr: 1;
        __IO uint32_t Enhtimer2_ccr_fifo_clr: 1;
        __IO uint32_t Enhtimer3_ccr_fifo_clr: 1;
        __IO uint32_t Enhtimer4_ccr_fifo_clr: 1;
        __IO uint32_t Enhtimer5_ccr_fifo_clr: 1;
        __IO uint32_t Enhtimer6_ccr_fifo_clr: 1;
        __IO uint32_t Enhtimer7_ccr_fifo_clr: 1;
        __IO uint32_t Enhtimer0_latch_cnt_0_fifo_clr: 1;
        __IO uint32_t Enhtimer1_latch_cnt_0_fifo_clr: 1;
        __IO uint32_t Enhtimer2_latch_cnt_0_fifo_clr: 1;
        __IO uint32_t Enhtimer3_latch_cnt_0_fifo_clr: 1;
        __IO uint32_t Enhtimer4_latch_cnt_0_fifo_clr: 1;
        __IO uint32_t Enhtimer5_latch_cnt_0_fifo_clr: 1;
        __IO uint32_t Enhtimer6_latch_cnt_0_fifo_clr: 1;
        __IO uint32_t Enhtimer7_latch_cnt_0_fifo_clr: 1;
        __IO uint32_t reserved_0: 16;
    } b;
} ENHTIM_FIFO_CLR_t;



/* 0x130
   0       R/W    Enhtimer0_enable                            1'h0
   1       R/W    Enhtimer1_enable                            1'h0
   2       R/W    Enhtimer2_enable                            1'h0
   3       R/W    Enhtimer3_enable                            1'h0
   4       R/W    Enhtimer4_enable                            1'h0
   5       R/W    Enhtimer5_enable                            1'h0
   6       R/W    Enhtimer6_enable                            1'h0
   7       R/W    Enhtimer7_enable                            1'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t Enhtimer0_enable: 1;
        __IO uint32_t Enhtimer1_enable: 1;
        __IO uint32_t Enhtimer2_enable: 1;
        __IO uint32_t Enhtimer3_enable: 1;
        __IO uint32_t Enhtimer4_enable: 1;
        __IO uint32_t Enhtimer5_enable: 1;
        __IO uint32_t Enhtimer6_enable: 1;
        __IO uint32_t Enhtimer7_enable: 1;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM_CONTROL_t;



