rtkconnectivity/hal_realtek/bee/drivers/enh_tim/src/rtl8772f/rtl_enhtim_def.h
/* 0x160
   7:0     R      Enhtimer4_latch_cnt_0_fifo_depth            8'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer4_latch_cnt_0_fifo_depth: 8;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM4_LATCH_FIFO_DEPTH_t;



/* 0x164
   7:0     R      Enhtimer5_latch_cnt_0_fifo_depth            8'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer5_latch_cnt_0_fifo_depth: 8;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM5_LATCH_FIFO_DEPTH_t;



/* 0x168
   7:0     R      Enhtimer6_latch_cnt_0_fifo_depth            8'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer6_latch_cnt_0_fifo_depth: 8;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM6_LATCH_FIFO_DEPTH_t;



/* 0x16C
   7:0     R      Enhtimer7_latch_cnt_0_fifo_depth            8'h0
   31:8    R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer7_latch_cnt_0_fifo_depth: 8;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM7_LATCH_FIFO_DEPTH_t;



/* 0x170
   0       R      Enhtimer0_toggle_state                      1'h0
   1       R      Enhtimer1_toggle_state                      1'h0
   2       R      Enhtimer2_toggle_state                      1'h0
   3       R      Enhtimer3_toggle_state                      1'h0
   4       R      Enhtimer4_toggle_state                      1'h0
   5       R      Enhtimer5_toggle_state                      1'h0
   6       R      Enhtimer6_toggle_state                      1'h0
   7       R      Enhtimer7_toggle_state                      1'h0
   31:24   R      RSVD                                        24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t Enhtimer0_toggle_state: 1;
        __I uint32_t Enhtimer1_toggle_state: 1;
        __I uint32_t Enhtimer2_toggle_state: 1;
        __I uint32_t Enhtimer3_toggle_state: 1;
        __I uint32_t Enhtimer4_toggle_state: 1;
        __I uint32_t Enhtimer5_toggle_state: 1;
        __I uint32_t Enhtimer6_toggle_state: 1;
        __I uint32_t Enhtimer7_toggle_state: 1;
        __I uint32_t reserved_0: 24;
    } b;
} ENHTIM_TOGGLE_STATE_t;



/* 0x270
   7:0     R/W    enhtimer_pwm_0_dead_zone_size       8'h0
   8       R/W    enhtimer_pwm_0_emg_stop             1'h0
   9       R/W    enhtimer_pwm_0_stop_state[0]        1'h0
   10      R/W    enhtimer_pwm_0_stop_state[1]        1'h0
   11      R/W    enhtimer_pwm_0_dummy_b11            1'h0
   12      R/W    enhtimer_pwm_0_dead_zone_en         1'h0
   13      R/W    enhtimer_pwm_0_pwm_pn_invserse_sel  1'h0
   14      R/W    enhtimer_pwm_0_dummy_b14            1'h0
   15      R/W    enhtimer_pwm_0_dummy_b15            1'h0
   31:16   R      RSVD                                16'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t enhtimer_pwm_dead_zone_size: 8;
        __IO uint32_t enhtimer_pwm_emg_stop: 1;
        __IO uint32_t enhtimer_pwm_stop_state_0: 1;
        __IO uint32_t enhtimer_pwm_stop_state_1: 1;
        __IO uint32_t enhtimer_pwm_dummy_b11: 1;
        __IO uint32_t enhtimer_pwm_dead_zone_en: 1;
        __IO uint32_t enhtimer_pwm_pwm_pn_invserse_sel: 1;
        __IO uint32_t enhtimer_pwm_dummy_b14: 1;
        __IO uint32_t enhtimer_pwm_dummy_b15: 1;
        __I uint32_t reserved_0: 16;
    } b;
} ENHTIMER_PWM_WRAP_CFG_t;



/* 0x360
   31:0   R      timer_ip_ver                          32'h2108162a
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t timer_ip_ver: 32;
    } b;
} ENHTIM_IP_VER_t;


/* ================================================================================ */
/* ================               ENH-TIMER  Constants             ================ */
/* ================================================================================ */
/** \defgroup ENHTIM_Exported_Constants ENHTIM Exported Constants
  * \brief
  * \{
  */

/**
 * \brief    ENHTIM_Clock_Source ENHTIM Clock Source
 *
 * \ingroup  ENHTIM_Exported_Types
 */
typedef enum
{
    ENHTIM_SOURCE_CLOCK_40M = 0x00,
    ENHTIM_SOURCE_CLOCK_32K = 0x04,
    ENHTIM_SOURCE_CLOCK_PLL2 = 0x02,
    ENHTIM_SOURCE_CLOCK_PLL1 = 0x01,
} ENHTIMClkSrc_TypdDef;
/** \} */
#define IS_ENHTIM_CLK_SOURCE(src) (((src) == ENHTIM_SOURCE_CLOCK_40M) || \
                                   ((src) == ENHTIM_SOURCE_CLOCK_32K)|| \\
                                   ((src) == ENHTIM_SOURCE_CLOCK_PLL2)|| \\
                                   ((src) == ENHTIM_SOURCE_CLOCK_PLL1))

/** End of ENHTIM_Exported_Constants
  * \}
  */

#ifdef  __cplusplus
}
#endif /* __cplusplus */

#endif /* RTL_ENHTIM_DEF_H */
